{
        "which of the following is listed as a single-gene trait in the observation table?": "Widow’s peak",
        "how are single-gene traits determined?": "By a single gene with dominant and recessive alleles",
        "which genotype represents an organism that is homozygous?": "GG",
        "what is the definition of \"phenotype\"?": "The set of observable characteristics of an organism",
        "which allele could represent the recessive trait for earlobe attachment?": "e",
        "what is the dominant phenotype for the \"hitchhiker’s thumb\" trait": "Straight Thumb",
        "what is a punnett square used for?": "To predict the probability of offspring inheriting specific genotypes and phenotypes",
        "if a parent with genotype dd (dimples) crosses with a parent with genotype dd (no dimples), what is the probability of the offspring having dimples?": "0.5",
        "what is the result of a homozygous cross between ff (freckles) and ff (no freckles)?": "100% of offspring have freckles (Ff)",
        "in a heterozygous cross (rr x rr) for tongue rolling, what percentage of offspring are expected to be non-rollers (rr)?": "0.25",
        "who is known as the father of modern genetics?": "Gregor Mendel",
        "why did mendel use pea plants for his experiments?": "They are small, easy to grow, and produce hundreds of offspring",
        "what does the term \"true-breeding\" mean in the context of mendel's plants?": "They produce offspring with identical traits to themselves through self-pollination",
        "what are \"hybrids\" in mendel's experiments?": "Offspring of crosses between parents with different contrasting characteristics",
        "in mendel's f1 generation crosses, what did he observe about the traits?": "The offspring had the characteristics of only one of the parents",
        "approximately what fraction of the f2 generation plants showed the recessive trait in mendel's experiments?": "One fourth (1/4)",
        "what does the principle of dominance state?": "An organism with both a dominant and recessive allele will exhibit the dominant characteristic",
        "what happens to alleles during gamete formation?": "They segregate (separate) from each other",
        "which year was gregor mendel born?": "1822",
        "what technique did mendel use to cross-pollinate plants?": "He cut away the pollen-bearing male parts and dusted pollen from another plant",
        "what does the \"f\" in f1 generation stand for?": "Filial",
        "which pod color was dominant in mendel's experiments?": "Green",
        "which seed shape was recessive in mendel's experiments?": "Wrinkled",
        "what is the recessive phenotype for the \"cleft chin\" trait?": "No Cleft Chin",
        "what is the definition of \"heredity\"?": "The passing of physical or mental characteristics from parents to offspring",
        "which term describes organisms that have two different alleles for the same gene (e.g., gg)?": "Heterozygous",
        "what did mendel assume happened to the recessive alleles in the f1 generation before seeing the f2 results?": "He assumed they had been masked by the dominant allele",
        "what term refers to the reproductive cells (sperm and egg)?": "Gametes",
        "which country is mentioned as the birthplace of gregor mendel?": "Austria (now Czech Republic)",
          "which of the following is listed as a single-gene trait in the observation table?": "Widow’s peak",
          "how are single-gene traits determined?": "By a single gene with dominant and recessive alleles",
          "which genotype represents an organism that is homozygous?": "GG",
          "what is the definition of \"phenotype\"?": "The set of observable characteristics of an organism",
          "which allele could represent the recessive trait for earlobe attachment?": "e",
          "what is the dominant phenotype for the &quot;hitchhiker’s thumb&quot; trait": "Straight Thumb",
          "what is a punnett square used for?": "To predict the probability of offspring inheriting specific genotypes and phenotypes",
          "if a parent with genotype dd (dimples) crosses with a parent with genotype dd (no dimples), what is the probability of the offspring having dimples?": "0.5",
          "what is the result of a homozygous cross between ff (freckles) and ff (no freckles)?": "100% of offspring have freckles (Ff)",
          "in a heterozygous cross (rr x rr) for tongue rolling, what percentage of offspring are expected to be non-rollers (rr)?": "0.25",
          "who is known as the father of modern genetics?": "Gregor Mendel",
          "why did mendel use pea plants for his experiments?": "They are small, easy to grow, and produce hundreds of offspring",
          "what does the term \"true-breeding\" mean in the context of mendel's plants?": "They produce offspring with identical traits to themselves through self-pollination",
          "what are \"hybrids\" in mendel's experiments?": "Offspring of crosses between parents with different contrasting characteristics",
          "in mendel's f1 generation crosses, what did he observe about the traits?": "The offspring had the characteristics of only one of the parents",
          "approximately what fraction of the f2 generation plants showed the recessive trait in mendel's experiments?": "One fourth (1/4)",
          "what does the principle of dominance state?": "An organism with both a dominant and recessive allele will exhibit the dominant characteristic",
          "what happens to alleles during gamete formation?": "They segregate (separate) from each other",
          "which year was gregor mendel born?": "1822",
          "what technique did mendel use to cross-pollinate plants?": "He cut away the pollen-bearing male parts and dusted pollen from another plant",
          "what does the \"f\" in f1 generation stand for?": "Filial",
          "which pod color was dominant in mendel's experiments?": "Green",
          "which seed shape was recessive in mendel's experiments?": "Wrinkled",
          "what is the recessive phenotype for the \"cleft chin\" trait?": "No Cleft Chin",
          "what is the definition of \"heredity\"?": "The passing of physical or mental characteristics from parents to offspring",
          "which term describes organisms that have two different alleles for the same gene (e.g., gg)?": "Heterozygous",
          "what did mendel assume happened to the recessive alleles in the f1 generation before seeing the f2 results?": "He assumed they had been masked by the dominant allele",
          "what term refers to the reproductive cells (sperm and egg)?": "Gametes",
          "which country is mentioned as the birthplace of gregor mendel?": "Austria (now Czech Republic)",
          "what is the primary definition of inheritable diseases according to the textbook?": "Conditions caused by abnormalities in a genome passed to offspring.",
          "which category of inheritable diseases is caused by a mutation in one specific gene?": "Single-Gene Disorders",
          "which of the following is an example of a chromosomal disorder mentioned in the textbook?": "Down Syndrome",
          "which phrase best describes the relationship between genes and environmental factors in the textbook?": "Genes load the gun, but the environment pulls the trigger.",
          "what is the main cause of multifactorial (complex) disorders?": "A combination of small variations in many genes plus environmental factors.",
          "which category of disorders is considered most important for general student awareness because lifestyle plays a huge role?": "Multifactorial Disorders",
          "what is the role of epigenetics as described in the textbook?": "It acts as chemical modifications that turn genes \"on\" or \"off\" without changing DNA.",
          "in the context of the \"triggers\" model, what triggers brain damage in a child with pku?": "Consumption of phenylalanine.",
          "how does the \"threshold effect\" explain the onset of a disease like type 2 diabetes?": "The disease only appears if environmental stress pushes a person over a certain risk level.",
          "why is early detection important for a student with a family history of colon cancer?": "It allows them to start screenings earlier in life.",
          "which of the following is listed as a primary trigger for skin cancer (melanoma)?": "UV Radiation (Sun exposure).",
          "for a student with a genetic susceptibility to lung cancer, what action multiplies their risk?": "Smoking.",
          "what is the specific genetic mechanism behind type 2 diabetes mentioned in the textbook?": "The body becomes resistant to insulin.",
          "which condition is listed under \"category a: lifestyle-responsive conditions\"?": "Hypertension",
          "what environmental factor is a major trigger for asthma?": "Air pollution and pollen.",
          "what is the genetic factor associated with myopia (nearsightedness)?": "Genes determine the shape of the eyeball.",
          "which food item acts as a trigger for g6pd deficiency?": "Fava beans.",
          "what management strategy is suggested for someone with hemophilia?": "Avoiding contact sports.",
          "which disorder is described as an x-linked recessive gene affecting retinal cones?": "Red-Green Color Blindness",
          "what is the environmental trigger for lactose intolerance?": "Consuming dairy products like milk.",
          "according to the textbook, what is the nature of single-gene disorders?": "They are strongly determined by genetics with less environmental influence on onset.",
          "what is the recommended student action for preventing heart disease in the summary table?": "Regular cardio and check cholesterol early.",
          "which of the following is not an example of a multifactorial disorder?": "Down Syndrome",
          "what does the textbook say about the \"environmental\" control for classic genetic disorders (category b)?": "It focuses on management and early detection rather than prevention.",
          "which environmental factor triggers migraines?": "Dehydration and specific foods like chocolate.",
          "what is the genetic risk factor for high cholesterol (familial hypercholesterolemia)?": "Liver struggles to remove bad cholesterol.",
          "which condition requires monitoring iron intake to avoid excess supplements?": "Thalassemia",
          "for a student with a family history of hypertension, what specific dietary advice is given?": "Watch salt intake.",
          "the textbook describes the interaction for skin cancer as:": "A trigger model where fair skin genes are the risk and UV is the trigger.",
          "which of the following is a primary trigger for high blood pressure?": "High salt intake and stress.",
          "why is destigmatization listed as a benefit of understanding inheritable diseases?": "It helps students realize genes are biology, not a \"curse\".",
          "which condition is caused by an enzyme deficiency affecting red blood cells?": "G6PD Deficiency",
          "what is the main trigger for myopia mentioned in the reference list?": "Excessive \"near work\" (screens/books).",
          "what is the recommended management for red-green color blindness?": "Using color-identifying apps.",
          "what characterizes single-gene traits?": "They are determined by a single gene and follow Mendelian inheritance patterns",
          "which of the following is considered a dominant trait for earlobe attachment?": "Free Earlobes",
          "according to the textbook which trait is likely determined by multiple genes and environmental influences rather than a strict mendelian pattern?": "Handedness",
          "what is the expected phenotype percentage for offspring in a homozygous cross for freckles (ff × ff)?": "100% have freckles",
          "which tool is used to predict the probability of offspring inheriting specific traits?": "Punnett Square",
          "in the example of a heterozygous cross for tongue rolling (rr × rr), what percentage of offspring are expected to be \"non-rollers\"?": "0.25",
          "which allele represents the recessive trait for a cleft chin?": "c",
          "if a parent with dimples (dd) and a parent without dimples (dd) have children, what percentage of the offspring are expected to have dimples?": "0.5",
          "how are alleles for single-gene traits inherited?": "One allele is inherited from each parent",
          "which of the following represents the dominant trait for a widow’s peak?": "Widow’s Peak Present",
          "what is the definition of heredity?": "The passing on of traits from parents to their offspring",
          "in the textbook used to explain biological instructions&#44; what does the &quot;giant cookbook&quot; represent?": "DNA",
          "why did gregor mendel choose to conduct his experiments on ordinary garden peas?": "They are small, easy to grow, and produce hundreds of offspring",
          "what describes the relationship between genes and alleles?": "Alleles are the different forms of a single gene",
          "what occurs during the process of fertilization in pea plants?": "Male and female reproductive cells join to produce a new cell",
          "what characteristic deﬁnes a \"true-breeding\" plant?": "It is self-pollinating and produces offspring with traits identical to itself",
          "according to mendel’s principle of dominance, what happens if an organism has both a dominant allele and a recessive allele for a speciﬁc trait?": "The organism will exhibit the dominant characteristic",
          "in mendel's experiments, what was the result of crossing true-breeding parents with contrasting traits (the p generation)?": "The offspring (F1) showed the characteristics of only one parent",
          "what phenomenon explains why recessive traits, which disappeared in the f1 generation, reappeared in the f2 generation?": "Segregation",
          "if an individual can roll their tongue into a \"taco\" shape, what does this indicate about their genetics according to the text?": "They received the \"rolling\" gene recipe from at least one parent",
          "what is the process by which offspring acquire genetic information from their parents?": "Heredity",
          "in the textbook&#44; analogy of the body as a &quot;lego castle&#44;&quot; what represents the instruction manuals passed down from parents?": "DNA",
          "if dna is compared to a giant cookbook, what is a single \"gene\" compared to?": "A single recipe",
          "why did gregor mendel choose ordinary garden peas for his experiments?": "They are small, easy to grow, and produce many offspring",
          "in the &quot;card deck&quot; textbook analogy&#44; how many &quot;cards&quot; (genes) does an offspring receive from each parent?": "Exactly half of the cards from each parent",
          "what are \"alleles\"?": "The different forms of a single gene",
          "when mendel crossed true-breeding tall plants with true-breeding short plants, what was the result in the f1 generation?": "All plants were tall",
          "what happened to the recessive traits in mendel's f2 generation?": "They reappeared in about one-fourth of the plants",
          "what term describes the separation of alleles during the formation of reproductive cells?": "Segregation",
          "which term describes the joining of male and female reproductive cells to produce a new cell?": "Fertilization",
          "which principle states that some alleles are dominant and others are recessive?": "Principle of dominance",
          "which characteristic will an organism exhibit if it has both a dominant allele and a recessive allele for a trait?": "The dominant characteristic",
          "how is \"phenotype\" defined?": "The set of observable characteristics or traits of an organism",
          "what does the term \"genotype\" refer to?": "The genetic makeup of an organism",
          "which of the following examples represents a homozygous organism?": "GG",
          "how is an organism classified if it has two different alleles for the same gene (e.g., gg)?": "Heterozygous",
          "what is the punnett square used to predict?": "The probability of offspring inheriting specific genotypes and phenotypes",
          "who developed the punnett square?": "Reginald C. Punnett",
          "in what year was the punnett square developed to visually represent mendelian inheritance?": "1905",
          "what happens to alleles for each gene during gamete formation?": "They segregate from each other",
          "what term describes pea plants that are self-pollinating and produce offspring with identical traits to themselves?": "True breeding",
          "how did gregor mendel prevent self-pollination in his pea plants during his experiments?": "He cut away the pollen-bearing male parts",
          "when mendel crossed true-breeding tall plants with true-breeding short plants, what was the result in the f1 generation?": "All plants were tall",
          "what happens to alleles for a specific gene during the formation of gametes?": "They segregate from each other",
          "in mendel’s f2 generation, approximately what fraction of the plants showed the trait controlled by the recessive allele?": "1/4",
          "which term refers to the physical characteristics of an organism, such as green pod color?": "Phenotype",
          "an organism that has two identical alleles for a particular gene (such as gg or gg) is described as what?": "Homozygous",
          "what principle states that genes for different traits can segregate independently during the formation of gametes?": "The principle of independent assortment",
          "a cross between red-flowered and white-flowered four o'clock plants results in pink flowers. what pattern of inheritance is this?": "Incomplete dominance",
          "what factor explains why buckeye butterflies hatching in autumn have darker wing patterns than those hatching in summer?": "Environmental influence on gene expression",
          "what is the primary reason given for the difference in health outcomes between the pima indians in mexico and the pima indians in arizona?": "The Pima in Arizona experienced a change in environment and diet, while the Pima in Mexico maintained a traditional lifestyle.",
          "what is the function of the \"thrifty gene\" described in the textbook?": "It is excellent at storing fat to help survive famines.",
          "the study of the dutch hunger winter demonstrated that environmental factors can impact health at which stage of life?": "Before birth (prenatally)",
          "what happened to the metabolisms of the babies who were in the womb during the dutch hunger winter?": "They were programmed to be \"thrifty\" and hoard every calorie.",
          "in the nasa twin study, what occurred to scott kelly's telomeres while he was in space?": "They got longer, which is a sign of cellular survival mode.",
          "what percentage of scott kelly's genes remained altered months after he returned to earth?": "0.07",
          "in the textbook \"genetics loads the gun, but the environment pulls the trigger,\" what represents the \"gun\"?": "Genetic predisposition or potential risk",
          "how does the textbook describe the relationship between dna and epigenetics?": "DNA is the hardware; epigenetics is the software.",
          "according to the textbook, how do whole foods like leafy greens assist in gene regulation?": "They provide methyl groups that help \"switch off\" bad genes.",
          "what is the \"mismatch\" referred to in the stories of the pima indians and the dutch hunger winter babies?": "The conflict between a biological programming for scarcity and an environment of abundance.",
          "in a case of incomplete dominance, what describes the phenotype of a heterozygous individual?": "It lies somewhere between the two homozygous phenotypes.",
          "when a red-flowered (rr) four o'clock plant is crossed with a white-flowered (rr) four o'clock plant, what is the color of the offspring?": "Pink",
          "which term describes a situation where the phenotypes produced by both alleles are clearly expressed, such as in \"erminette\" chickens?": "Codominance",
          "a rabbit's coat color is determined by a single gene that has at least four different alleles. this is an example of which pattern of inheritance?": "Multiple alleles",
          "based on the provided textbook regarding blood type genetics, which genotype represents a person with blood type o?": "$I^O I^O$",
          "according to the textbook, which blood type is considered the universal recipient because they can receive blood from any other type (o-, o+, b-, b+, a-, a+, ab-, ab+)?": "AB+",
          "examining the \"antibodies in plasma\" textbook, which antibodies are found in the plasma of a person with type a blood?": "Anti-B",
          "in the example of human cholesterol levels mentioned in the textbook, how does the heterozygous form of the gene function?": "It produces two different forms of the protein, each affecting cholesterol levels.",
          "which antigens are present on the red blood cells of an individual with blood type ab?": "Both A and B antigens",
          "according to the donor compatibility textbook, a person with blood type o- can donate to which of the following recipients?": "All recipient blood types (O, A, B, AB positive and negative)",
          "what characteristic will an organism exhibit if it possesses both a dominant allele and a recessive allele for a particular trait?": "The dominant characteristic",
          "which term describes the set of observable characteristics or traits of an organism?": "Phenotype",
          "what is the definition of genotype?": "The genetic makeup of an organism",
          "which of the following examples represents a homozygous genotype?": "GG",
          "what term is used to describe organisms that have two different alleles for the same gene?": "Heterozygous",
          "what is the primary purpose of a punnett square?": "To predict the probability of offspring inheriting specific genotypes and phenotypes",
          "who developed the punnett square?": "Reginald C. Punnett",
          "in what year was the punnett square developed?": "1905",
          "what happens to the alleles for each gene during gamete formation?": "They segregate from each other",
          "how many alleles for each gene does a single gamete carry?": "One"
}
