{
        "which of the following is listed as a single-gene trait in the observation table?": "Widow’s peak",
        "how are single-gene traits determined?": "By a single gene with dominant and recessive alleles",
        "which genotype represents an organism that is homozygous?": "GG",
        "what is the definition of \"phenotype\"?": "The set of observable characteristics of an organism",
        "which allele could represent the recessive trait for earlobe attachment?": "e",
        "what is the dominant phenotype for the \"hitchhiker’s thumb\" trait": "Straight Thumb",
        "what is a punnett square used for?": "To predict the probability of offspring inheriting specific genotypes and phenotypes",
        "if a parent with genotype dd (dimples) crosses with a parent with genotype dd (no dimples), what is the probability of the offspring having dimples?": "0.5",
        "what is the result of a homozygous cross between ff (freckles) and ff (no freckles)?": "100% of offspring have freckles (Ff)",
        "in a heterozygous cross (rr x rr) for tongue rolling, what percentage of offspring are expected to be non-rollers (rr)?": "0.25",
        "who is known as the father of modern genetics?": "Gregor Mendel",
        "why did mendel use pea plants for his experiments?": "They are small, easy to grow, and produce hundreds of offspring",
        "what does the term \"true-breeding\" mean in the context of mendel's plants?": "They produce offspring with identical traits to themselves through self-pollination",
        "what are \"hybrids\" in mendel's experiments?": "Offspring of crosses between parents with different contrasting characteristics",
        "in mendel's f1 generation crosses, what did he observe about the traits?": "The offspring had the characteristics of only one of the parents",
        "approximately what fraction of the f2 generation plants showed the recessive trait in mendel's experiments?": "One fourth (1/4)",
        "what does the principle of dominance state?": "An organism with both a dominant and recessive allele will exhibit the dominant characteristic",
        "what happens to alleles during gamete formation?": "They segregate (separate) from each other",
        "which year was gregor mendel born?": "1822",
        "what technique did mendel use to cross-pollinate plants?": "He cut away the pollen-bearing male parts and dusted pollen from another plant",
        "what does the \"f\" in f1 generation stand for?": "Filial",
        "which pod color was dominant in mendel's experiments?": "Green",
        "which seed shape was recessive in mendel's experiments?": "Wrinkled",
        "what is the recessive phenotype for the \"cleft chin\" trait?": "No Cleft Chin",
        "what is the definition of \"heredity\"?": "The passing of physical or mental characteristics from parents to offspring",
        "which term describes organisms that have two different alleles for the same gene (e.g., gg)?": "Heterozygous",
        "what did mendel assume happened to the recessive alleles in the f1 generation before seeing the f2 results?": "He assumed they had been masked by the dominant allele",
        "what term refers to the reproductive cells (sperm and egg)?": "Gametes",
        "which country is mentioned as the birthplace of gregor mendel?": "Austria (now Czech Republic)"
}
