{
        "which of the following is listed as a single-gene trait in the observation table?": "Widow’s peak",
        "how are single-gene traits determined?": "By a single gene with dominant and recessive alleles",
        "which genotype represents an organism that is homozygous?": "GG",
        "what is the definition of \"phenotype\"?": "The set of observable characteristics of an organism",
        "which allele could represent the recessive trait for earlobe attachment?": "e",
        "what is the dominant phenotype for the \"hitchhiker’s thumb\" trait": "Straight Thumb",
        "what is a punnett square used for?": "To predict the probability of offspring inheriting specific genotypes and phenotypes",
        "if a parent with genotype dd (dimples) crosses with a parent with genotype dd (no dimples), what is the probability of the offspring having dimples?": "0.5",
        "what is the result of a homozygous cross between ff (freckles) and ff (no freckles)?": "100% of offspring have freckles (Ff)",
        "in a heterozygous cross (rr x rr) for tongue rolling, what percentage of offspring are expected to be non-rollers (rr)?": "0.25",
        "who is known as the father of modern genetics?": "Gregor Mendel",
        "why did mendel use pea plants for his experiments?": "They are small, easy to grow, and produce hundreds of offspring",
        "what does the term \"true-breeding\" mean in the context of mendel's plants?": "They produce offspring with identical traits to themselves through self-pollination",
        "what are \"hybrids\" in mendel's experiments?": "Offspring of crosses between parents with different contrasting characteristics",
        "in mendel's f1 generation crosses, what did he observe about the traits?": "The offspring had the characteristics of only one of the parents",
        "approximately what fraction of the f2 generation plants showed the recessive trait in mendel's experiments?": "One fourth (1/4)",
        "what does the principle of dominance state?": "An organism with both a dominant and recessive allele will exhibit the dominant characteristic",
        "what happens to alleles during gamete formation?": "They segregate (separate) from each other",
        "which year was gregor mendel born?": "1822",
        "what technique did mendel use to cross-pollinate plants?": "He cut away the pollen-bearing male parts and dusted pollen from another plant",
        "what does the \"f\" in f1 generation stand for?": "Filial",
        "which pod color was dominant in mendel's experiments?": "Green",
        "which seed shape was recessive in mendel's experiments?": "Wrinkled",
        "what is the recessive phenotype for the \"cleft chin\" trait?": "No Cleft Chin",
        "what is the definition of \"heredity\"?": "The passing of physical or mental characteristics from parents to offspring",
        "which term describes organisms that have two different alleles for the same gene (e.g., gg)?": "Heterozygous",
        "what did mendel assume happened to the recessive alleles in the f1 generation before seeing the f2 results?": "He assumed they had been masked by the dominant allele",
        "what term refers to the reproductive cells (sperm and egg)?": "Gametes",
        "which country is mentioned as the birthplace of gregor mendel?": "Austria (now Czech Republic)",
          "which of the following is listed as a single-gene trait in the observation table?": "Widow’s peak",
          "how are single-gene traits determined?": "By a single gene with dominant and recessive alleles",
          "which genotype represents an organism that is homozygous?": "GG",
          "what is the definition of \"phenotype\"?": "The set of observable characteristics of an organism",
          "which allele could represent the recessive trait for earlobe attachment?": "e",
          "what is the dominant phenotype for the &quot;hitchhiker’s thumb&quot; trait": "Straight Thumb",
          "what is a punnett square used for?": "To predict the probability of offspring inheriting specific genotypes and phenotypes",
          "if a parent with genotype dd (dimples) crosses with a parent with genotype dd (no dimples), what is the probability of the offspring having dimples?": "0.5",
          "what is the result of a homozygous cross between ff (freckles) and ff (no freckles)?": "100% of offspring have freckles (Ff)",
          "in a heterozygous cross (rr x rr) for tongue rolling, what percentage of offspring are expected to be non-rollers (rr)?": "0.25",
          "who is known as the father of modern genetics?": "Gregor Mendel",
          "why did mendel use pea plants for his experiments?": "They are small, easy to grow, and produce hundreds of offspring",
          "what does the term \"true-breeding\" mean in the context of mendel's plants?": "They produce offspring with identical traits to themselves through self-pollination",
          "what are \"hybrids\" in mendel's experiments?": "Offspring of crosses between parents with different contrasting characteristics",
          "in mendel's f1 generation crosses, what did he observe about the traits?": "The offspring had the characteristics of only one of the parents",
          "approximately what fraction of the f2 generation plants showed the recessive trait in mendel's experiments?": "One fourth (1/4)",
          "what does the principle of dominance state?": "An organism with both a dominant and recessive allele will exhibit the dominant characteristic",
          "what happens to alleles during gamete formation?": "They segregate (separate) from each other",
          "which year was gregor mendel born?": "1822",
          "what technique did mendel use to cross-pollinate plants?": "He cut away the pollen-bearing male parts and dusted pollen from another plant",
          "what does the \"f\" in f1 generation stand for?": "Filial",
          "which pod color was dominant in mendel's experiments?": "Green",
          "which seed shape was recessive in mendel's experiments?": "Wrinkled",
          "what is the recessive phenotype for the \"cleft chin\" trait?": "No Cleft Chin",
          "what is the definition of \"heredity\"?": "The passing of physical or mental characteristics from parents to offspring",
          "which term describes organisms that have two different alleles for the same gene (e.g., gg)?": "Heterozygous",
          "what did mendel assume happened to the recessive alleles in the f1 generation before seeing the f2 results?": "He assumed they had been masked by the dominant allele",
          "what term refers to the reproductive cells (sperm and egg)?": "Gametes",
          "which country is mentioned as the birthplace of gregor mendel?": "Austria (now Czech Republic)",
          "what is the primary definition of inheritable diseases according to the textbook?": "Conditions caused by abnormalities in a genome passed to offspring.",
          "which category of inheritable diseases is caused by a mutation in one specific gene?": "Single-Gene Disorders",
          "which of the following is an example of a chromosomal disorder mentioned in the textbook?": "Down Syndrome",
          "which phrase best describes the relationship between genes and environmental factors in the textbook?": "Genes load the gun, but the environment pulls the trigger.",
          "what is the main cause of multifactorial (complex) disorders?": "A combination of small variations in many genes plus environmental factors.",
          "which category of disorders is considered most important for general student awareness because lifestyle plays a huge role?": "Multifactorial Disorders",
          "what is the role of epigenetics as described in the textbook?": "It acts as chemical modifications that turn genes \"on\" or \"off\" without changing DNA.",
          "in the context of the \"triggers\" model, what triggers brain damage in a child with pku?": "Consumption of phenylalanine.",
          "how does the \"threshold effect\" explain the onset of a disease like type 2 diabetes?": "The disease only appears if environmental stress pushes a person over a certain risk level.",
          "why is early detection important for a student with a family history of colon cancer?": "It allows them to start screenings earlier in life.",
          "which of the following is listed as a primary trigger for skin cancer (melanoma)?": "UV Radiation (Sun exposure).",
          "for a student with a genetic susceptibility to lung cancer, what action multiplies their risk?": "Smoking.",
          "what is the specific genetic mechanism behind type 2 diabetes mentioned in the textbook?": "The body becomes resistant to insulin.",
          "which condition is listed under \"category a: lifestyle-responsive conditions\"?": "Hypertension",
          "what environmental factor is a major trigger for asthma?": "Air pollution and pollen.",
          "what is the genetic factor associated with myopia (nearsightedness)?": "Genes determine the shape of the eyeball.",
          "which food item acts as a trigger for g6pd deficiency?": "Fava beans.",
          "what management strategy is suggested for someone with hemophilia?": "Avoiding contact sports.",
          "which disorder is described as an x-linked recessive gene affecting retinal cones?": "Red-Green Color Blindness",
          "what is the environmental trigger for lactose intolerance?": "Consuming dairy products like milk.",
          "according to the textbook, what is the nature of single-gene disorders?": "They are strongly determined by genetics with less environmental influence on onset.",
          "what is the recommended student action for preventing heart disease in the summary table?": "Regular cardio and check cholesterol early.",
          "which of the following is not an example of a multifactorial disorder?": "Down Syndrome",
          "what does the textbook say about the \"environmental\" control for classic genetic disorders (category b)?": "It focuses on management and early detection rather than prevention.",
          "which environmental factor triggers migraines?": "Dehydration and specific foods like chocolate.",
          "what is the genetic risk factor for high cholesterol (familial hypercholesterolemia)?": "Liver struggles to remove bad cholesterol.",
          "which condition requires monitoring iron intake to avoid excess supplements?": "Thalassemia",
          "for a student with a family history of hypertension, what specific dietary advice is given?": "Watch salt intake.",
          "the textbook describes the interaction for skin cancer as:": "A trigger model where fair skin genes are the risk and UV is the trigger.",
          "which of the following is a primary trigger for high blood pressure?": "High salt intake and stress.",
          "why is destigmatization listed as a benefit of understanding inheritable diseases?": "It helps students realize genes are biology, not a \"curse\".",
          "which condition is caused by an enzyme deficiency affecting red blood cells?": "G6PD Deficiency",
          "what is the main trigger for myopia mentioned in the reference list?": "Excessive \"near work\" (screens/books).",
          "what is the recommended management for red-green color blindness?": "Using color-identifying apps.",
          "what characterizes single-gene traits?": "They are determined by a single gene and follow Mendelian inheritance patterns",
          "which of the following is considered a dominant trait for earlobe attachment?": "Free Earlobes",
          "according to the textbook which trait is likely determined by multiple genes and environmental influences rather than a strict mendelian pattern?": "Handedness",
          "what is the expected phenotype percentage for offspring in a homozygous cross for freckles (ff × ff)?": "100% have freckles",
          "which tool is used to predict the probability of offspring inheriting specific traits?": "Punnett Square",
          "in the example of a heterozygous cross for tongue rolling (rr × rr), what percentage of offspring are expected to be \"non-rollers\"?": "0.25",
          "which allele represents the recessive trait for a cleft chin?": "c",
          "if a parent with dimples (dd) and a parent without dimples (dd) have children, what percentage of the offspring are expected to have dimples?": "0.5",
          "how are alleles for single-gene traits inherited?": "One allele is inherited from each parent",
          "which of the following represents the dominant trait for a widow’s peak?": "Widow’s Peak Present",
          "what is the definition of heredity?": "The passing on of traits from parents to their offspring",
          "in the textbook used to explain biological instructions&#44; what does the &quot;giant cookbook&quot; represent?": "DNA",
          "why did gregor mendel choose to conduct his experiments on ordinary garden peas?": "They are small, easy to grow, and produce hundreds of offspring",
          "what describes the relationship between genes and alleles?": "Alleles are the different forms of a single gene",
          "what occurs during the process of fertilization in pea plants?": "Male and female reproductive cells join to produce a new cell",
          "what characteristic deﬁnes a \"true-breeding\" plant?": "It is self-pollinating and produces offspring with traits identical to itself",
          "according to mendel’s principle of dominance, what happens if an organism has both a dominant allele and a recessive allele for a speciﬁc trait?": "The organism will exhibit the dominant characteristic",
          "in mendel's experiments, what was the result of crossing true-breeding parents with contrasting traits (the p generation)?": "The offspring (F1) showed the characteristics of only one parent",
          "what phenomenon explains why recessive traits, which disappeared in the f1 generation, reappeared in the f2 generation?": "Segregation",
          "if an individual can roll their tongue into a \"taco\" shape, what does this indicate about their genetics according to the text?": "They received the \"rolling\" gene recipe from at least one parent",
          "what is the process by which offspring acquire genetic information from their parents?": "Heredity",
          "in the textbook&#44; analogy of the body as a &quot;lego castle&#44;&quot; what represents the instruction manuals passed down from parents?": "DNA",
          "if dna is compared to a giant cookbook, what is a single \"gene\" compared to?": "A single recipe",
          "why did gregor mendel choose ordinary garden peas for his experiments?": "They are small, easy to grow, and produce many offspring",
          "in the &quot;card deck&quot; textbook analogy&#44; how many &quot;cards&quot; (genes) does an offspring receive from each parent?": "Exactly half of the cards from each parent",
          "what are \"alleles\"?": "The different forms of a single gene",
          "when mendel crossed true-breeding tall plants with true-breeding short plants, what was the result in the f1 generation?": "All plants were tall",
          "what happened to the recessive traits in mendel's f2 generation?": "They reappeared in about one-fourth of the plants",
          "what term describes the separation of alleles during the formation of reproductive cells?": "Segregation",
          "which term describes the joining of male and female reproductive cells to produce a new cell?": "Fertilization",
          "which principle states that some alleles are dominant and others are recessive?": "Principle of dominance",
          "which characteristic will an organism exhibit if it has both a dominant allele and a recessive allele for a trait?": "The dominant characteristic",
          "how is \"phenotype\" defined?": "The set of observable characteristics or traits of an organism",
          "what does the term \"genotype\" refer to?": "The genetic makeup of an organism",
          "which of the following examples represents a homozygous organism?": "GG",
          "how is an organism classified if it has two different alleles for the same gene (e.g., gg)?": "Heterozygous",
          "what is the punnett square used to predict?": "The probability of offspring inheriting specific genotypes and phenotypes",
          "who developed the punnett square?": "Reginald C. Punnett",
          "in what year was the punnett square developed to visually represent mendelian inheritance?": "1905",
          "what happens to alleles for each gene during gamete formation?": "They segregate from each other",
          "what term describes pea plants that are self-pollinating and produce offspring with identical traits to themselves?": "True breeding",
          "how did gregor mendel prevent self-pollination in his pea plants during his experiments?": "He cut away the pollen-bearing male parts",
          "when mendel crossed true-breeding tall plants with true-breeding short plants, what was the result in the f1 generation?": "All plants were tall",
          "what happens to alleles for a specific gene during the formation of gametes?": "They segregate from each other",
          "in mendel’s f2 generation, approximately what fraction of the plants showed the trait controlled by the recessive allele?": "1/4",
          "which term refers to the physical characteristics of an organism, such as green pod color?": "Phenotype",
          "an organism that has two identical alleles for a particular gene (such as gg or gg) is described as what?": "Homozygous",
          "what principle states that genes for different traits can segregate independently during the formation of gametes?": "The principle of independent assortment",
          "a cross between red-flowered and white-flowered four o'clock plants results in pink flowers. what pattern of inheritance is this?": "Incomplete dominance",
          "what factor explains why buckeye butterflies hatching in autumn have darker wing patterns than those hatching in summer?": "Environmental influence on gene expression",
          "what is the primary reason given for the difference in health outcomes between the pima indians in mexico and the pima indians in arizona?": "The Pima in Arizona experienced a change in environment and diet, while the Pima in Mexico maintained a traditional lifestyle.",
          "what is the function of the \"thrifty gene\" described in the textbook?": "It is excellent at storing fat to help survive famines.",
          "the study of the dutch hunger winter demonstrated that environmental factors can impact health at which stage of life?": "Before birth (prenatally)",
          "what happened to the metabolisms of the babies who were in the womb during the dutch hunger winter?": "They were programmed to be \"thrifty\" and hoard every calorie.",
          "in the nasa twin study, what occurred to scott kelly's telomeres while he was in space?": "They got longer, which is a sign of cellular survival mode.",
          "what percentage of scott kelly's genes remained altered months after he returned to earth?": "0.07",
          "in the textbook \"genetics loads the gun, but the environment pulls the trigger,\" what represents the \"gun\"?": "Genetic predisposition or potential risk",
          "how does the textbook describe the relationship between dna and epigenetics?": "DNA is the hardware; epigenetics is the software.",
          "according to the textbook, how do whole foods like leafy greens assist in gene regulation?": "They provide methyl groups that help \"switch off\" bad genes.",
          "what is the \"mismatch\" referred to in the stories of the pima indians and the dutch hunger winter babies?": "The conflict between a biological programming for scarcity and an environment of abundance.",
          "in a case of incomplete dominance, what describes the phenotype of a heterozygous individual?": "It lies somewhere between the two homozygous phenotypes.",
          "when a red-flowered (rr) four o'clock plant is crossed with a white-flowered (rr) four o'clock plant, what is the color of the offspring?": "Pink",
          "which term describes a situation where the phenotypes produced by both alleles are clearly expressed, such as in \"erminette\" chickens?": "Codominance",
          "a rabbit's coat color is determined by a single gene that has at least four different alleles. this is an example of which pattern of inheritance?": "Multiple alleles",
          "based on the provided textbook regarding blood type genetics, which genotype represents a person with blood type o?": "IOIOIOIO",
          "based on the provided textbook regarding blood type genetics, which genotype represents a person with blood type o?": "IOIO",
          "according to the textbook, which blood type is considered the universal recipient because they can receive blood from any other type (o-, o+, b-, b+, a-, a+, ab-, ab+)?": "AB+",
          "examining the \"antibodies in plasma\" textbook, which antibodies are found in the plasma of a person with type a blood?": "Anti-B",
          "in the example of human cholesterol levels mentioned in the textbook, how does the heterozygous form of the gene function?": "It produces two different forms of the protein, each affecting cholesterol levels.",
          "which antigens are present on the red blood cells of an individual with blood type ab?": "Both A and B antigens",
          "according to the donor compatibility textbook, a person with blood type o- can donate to which of the following recipients?": "All recipient blood types (O, A, B, AB positive and negative)",
          "what characteristic will an organism exhibit if it possesses both a dominant allele and a recessive allele for a particular trait?": "The dominant characteristic",
          "which term describes the set of observable characteristics or traits of an organism?": "Phenotype",
          "what is the definition of genotype?": "The genetic makeup of an organism",
          "which of the following examples represents a homozygous genotype?": "GG",
          "what term is used to describe organisms that have two different alleles for the same gene?": "Heterozygous",
          "what is the primary purpose of a punnett square?": "To predict the probability of offspring inheriting specific genotypes and phenotypes",
          "who developed the punnett square?": "Reginald C. Punnett",
          "in what year was the punnett square developed?": "1905",
          "what happens to the alleles for each gene during gamete formation?": "They segregate from each other",
          "how many alleles for each gene does a single gamete carry?": "One",
          "what term describes the interplay between an individual's genetic makeup and their environmental exposures in influencing disease risk?": "Gene-environment interaction",
          "which of the following is a physical environmental factor that can influence an individual's health?": "Air quality",
          "what type of mutation is inherited from a parent?": "Germline mutation",
          "which gene mutations are associated with an increased risk of breast cancer?": "BRCA1 and BRCA2",
          "which environmental factor is a major risk for developing lung cancer?": "Smoking",
          "what is epigenetics?": "Changes in gene expression without altering DNA sequence",
          "which epigenetic mechanism involves adding methyl groups to dna?": "DNA methylation",
          "in type 2 diabetes, what environmental factor can influence whether a genetically predisposed individual develops the disease?": "Diet and exercise",
          "which of the following is a social environmental factor?": "Access to healthcare",
          "what type of disease is influenced by both genetic and environmental factors and does not have a single cause?": "Complex disease",
          "which gene is associated with an increased risk of alzheimer's disease?": "APOE",
          "which environmental factor is linked to the development of autoimmune diseases like lupus?": "Infections and sun exposure",
          "what role do non-coding rnas play in epigenetics?": "They regulate gene expression",
          "which disease is an example of gene-environment interaction where pesticide exposure is a risk factor?": "Parkinson's Disease",
          "what is a genetic predisposition?": "A higher genetic risk for certain diseases",
          "which gene variant is associated with resistance or susceptibility to hiv?": "CCR5 mutation",
          "which of the following is an example of an epigenetic change influenced by maternal nutrition?": "DNA methylation affecting metabolism genes",
          "what is a key benefit of understanding gene-environment interactions in public health?": "It allows for targeted prevention and treatment strategies",
          "which of the following is a lifestyle environmental factor affecting obesity?": "High-calorie diet",
          "in asthma, what environmental exposure can trigger attacks in genetically predisposed individuals?": "Allergens like dust mites",
          "what environmental factor can influence the development of hypertension in genetically predisposed individuals?": "High-salt diet",
          "which of the following is not a psychosocial environmental factor?": "Air pollution",
          "which environmental factor is a major contributor to chronic obstructive pulmonary disease (copd)?": "Smoking",
          "what is a key characteristic of complex diseases?": "Result from interactions between multiple genes and environmental factors",
          "which genetic factor can influence cholesterol metabolism and increase the risk of cardiovascular diseases?": "Genetic variations related to cholesterol metabolism",
          "in type 2 diabetes, what genetic factor contributes to the disease?": "Insulin resistance",
          "which environmental factor is associated with multiple sclerosis in the context of gene-environment interaction?": "Sunlight exposure affecting vitamin D levels",
          "which disease is characterized by seizures triggered by factors like stress or sleep deprivation in genetically predisposed individuals?": "Epilepsy",
          "what is the role of histone modification in gene expression?": "It affects how DNA is packaged, influencing gene expression",
          "which mental health disorder can be influenced by both genetic predisposition and life events like trauma?": "Depression",
          "what environmental factor is linked to the increased risk of rheumatoid arthritis?": "Smoking",
          "which gene is associated with insulin resistance in type 2 diabetes?": "Genes affecting insulin signaling pathways",
          "which environmental factor can influence epigenetic marks related to gene expression?": "Diet and stress",
          "what is the impact of personalized medicine in the context of gene-environment interactions?": "It tailors prevention and treatment plans to individual genetic and environmental profiles",
          "which autoimmune disease is more common in individuals living farther from the equator?": "Multiple sclerosis",
          "which environmental factor can trigger celiac disease in genetically predisposed individuals?": "Gluten consumption",
          "which factor is not considered a lifestyle environmental factor?": "Air pollution",
          "which of the following is an example of a gene-environment interaction in cancer?": "UV radiation exposure in individuals with certain genetic mutations leading to skin cancer",
          "1. what characterizes single-gene traits? （单基因性状有什么特征？）": "A. They are determined by a single gene and follow Mendelian inheritance patterns （A. 它们由单个基因决定并遵循孟德尔遗传模式）",
          "2. which of the following is considered a dominant trait for earlobe attachment? （以下哪项被认为是耳垂附着的显性性状？）": "B. Free Earlobes （B. 游离耳垂）",
          "3. according to the textbook which trait is likely determined by multiple genes and environmental influences rather than a strict mendelian pattern? （根据教科书，哪种性状可能由多基因和环境影响决定，而不是严格的孟德尔模式？）": "D. Handedness （D. 惯用手）",
          "4. what is the expected phenotype percentage for offspring in a homozygous cross for freckles (ff × ff)? （雀斑纯合杂交（ff × ff）的后代预期表型百分比是多少？）": "C. 100% have freckles （C. 100%有雀斑）",
          "5. which tool is used to predict the probability of offspring inheriting specific traits? （哪种工具用于预测后代遗传特定性状的概率？）": "A. Punnett Square （A. 普纳特方格/庞氏表）",
          "6. in the example of a heterozygous cross for tongue rolling (rr × rr), what percentage of offspring are expected to be \"non-rollers\"? （在卷舌的杂合杂交（rr × rr）例子中，预计有多少百分比的后代是“不能卷舌者”？）": "B. 0.25 （B. 0.25）",
          "7. which allele represents the recessive trait for a cleft chin? （哪个等位基因代表颏裂的隐性性状？）": "D. c （D. c）",
          "8. if a parent with dimples (dd) and a parent without dimples (dd) have children, what percentage of the offspring are expected to have dimples? （如果一个有酒窝的父母（dd）和一个没有酒窝的父母（dd）生孩子，预计有多少百分比的后代会有酒窝？）": "A. 0.5 （A. 0.5）",
          "9. how are alleles for single-gene traits inherited? （单基因性状的等位基因是如何遗传的？）": "C. One allele is inherited from each parent （C. 每个父母各遗传一个等位基因）",
          "10. which of the following represents the dominant trait for a widow’s peak? （以下哪项代表美人尖的显性性状？）": "D. Widow’s Peak Present （D. 有美人尖）",
          "11. what is the definition of heredity? （遗传的定义是什么？）": "B. The passing on of traits from parents to their offspring （B. 性状从父母传给后代的过程）",
          "12. in the textbook used to explain biological instructions, what does the \"giant cookbook\" represent? （在用于解释生物指令的教科书中，“巨大的食谱”代表什么？）": "D. DNA （D. DNA）",
          "13. why did gregor mendel choose to conduct his experiments on ordinary garden peas? （为什么格雷戈尔·孟德尔选择在普通豌豆上进行实验？）": "D. They are small, easy to grow, and produce hundreds of offspring （D. 它们体型小，易于种植，并且能产生数百个后代）",
          "14. what describes the relationship between genes and alleles? （怎样描述基因和等位基因之间的关系？）": "D. Alleles are the different forms of a single gene （D. 等位基因是单个基因的不同形式）",
          "15. what occurs during the process of fertilization in pea plants? （在豌豆植物的受精过程中会发生什么？）": "C. Male and female reproductive cells join to produce a new cell （C. 雄性和雌性生殖细胞结合产生一个新细胞）",
          "16. what characteristic deﬁnes a \"true-breeding\" plant? （“纯种繁殖”植物的定义特征是什么？）": "A. It is self-pollinating and produces offspring with traits identical to itself （A. 它是自花授粉的，产生的后代性状与其自身完全相同）",
          "17. according to mendel’s principle of dominance, what happens if an organism has both a dominant allele and a recessive allele for a speciﬁc trait? （根据孟德尔的显性原则，如果一个生物体对特定性状既有显性等位基因又有隐性等位基因，会发生什么？）": "C. The organism will exhibit the dominant characteristic （C. 生物体将表现出显性特征）",
          "18. in mendel's experiments, what was the result of crossing true-breeding parents with contrasting traits (the p generation)? （在孟德尔的实验中，杂交具有相对性状的纯种亲本（p代）的结果是什么？）": "B. The offspring (F1) showed the characteristics of only one parent （B. 后代（F1）仅表现出其中一个亲本的特征）",
          "19. what phenomenon explains why recessive traits, which disappeared in the f1 generation, reappeared in the f2 generation? （什么现象解释了为什么在f1代消失的隐性性状在f2代重新出现？）": "C. Segregation （C. 分离）",
          "20. if an individual can roll their tongue into a \"taco\" shape, what does this indicate about their genetics according to the text? （如果一个人能把舌头卷成“塔克”状，根据文本这表明他们的遗传学特征是什么？）": "B. They received the \"rolling\" gene recipe from at least one parent （B. 他们至少从一个亲本那里接收了“卷舌”的基因配方）",
          "21. what is the process by which offspring acquire genetic information from their parents? （后代从父母那里获取遗传信息的过程叫什么？）": "C. Heredity （C. 遗传）",
          "22. in the textbook, analogy of the body as a \"lego castle,\" what represents the instruction manuals passed down from parents? （在教科书中把身体比作“乐高城堡”的类比中，什么代表从父母传下来的说明书？）": "B. DNA （B. DNA）",
          "23. if dna is compared to a giant cookbook, what is a single \"gene\" compared to? （如果将dna比作一本巨大的食谱，那么单个“基因”比作什么？）": "C. A single recipe （C. 单个食谱）",
          "24. why did gregor mendel choose ordinary garden peas for his experiments? （为什么格雷戈尔·孟德尔选择普通豌豆进行实验？）": "D. They are small, easy to grow, and produce many offspring （D. 它们体型小，易于种植，并且产生许多后代）",
          "25. in the \"card deck\" textbook analogy, how many \"cards\" (genes) does an offspring receive from each parent? （在教科书的“扑克牌”类比中，后代从每个父母那里收到多少张“牌”（基因）？）": "B. Exactly half of the cards from each parent （B. 正好从每个父母那里各收到一半的牌）",
          "26. what are \"alleles\"? （什么是“等位基因”？）": "B. The different forms of a single gene （B. 单个基因的不同形式）",
          "27. when mendel crossed true-breeding tall plants with true-breeding short plants, what was the result in the f1 generation? （当孟德尔将纯种高植株与纯种矮植株杂交时，f1代的结果是什么？）": "B. All plants were tall （B. 所有植株都是高的）",
          "28. what happened to the recessive traits in mendel's f2 generation? （孟德尔f2代中的隐性性状发生了什么？）": "C. They reappeared in about one-fourth of the plants （C. 它们在大约四分之一的植株中重新出现）",
          "29. what term describes the separation of alleles during the formation of reproductive cells? （什么术语描述了生殖细胞形成过程中等位基因的分离？）": "B. Segregation （B. 分离）",
          "30. which term describes the joining of male and female reproductive cells to produce a new cell? （哪个术语描述了雄性和雌性生殖细胞结合产生新细胞的过程？）": "A. Fertilization （A. 受精）",
          "31. which principle states that some alleles are dominant and others are recessive? （哪个原则指出有些等位基因是显性的，而另一些是隐性的？）": "C. Principle of dominance （C. 显性原则）",
          "32. which characteristic will an organism exhibit if it has both a dominant allele and a recessive allele for a trait? （如果一个生物体对某种性状既有显性等位基因又有隐性等位基因，它将表现出哪种特征？）": "C. The dominant characteristic （C. 显性特征）",
          "33. how is \"phenotype\" defined? （“表型”是如何定义的？）": "B. The set of observable characteristics or traits of an organism （B. 生物体的一组可观察的特征或性状）",
          "34. what does the term \"genotype\" refer to? （术语“基因型”指的是什么？）": "C. The genetic makeup of an organism （C. 生物体的遗传构成）",
          "35. which of the following examples represents a homozygous organism? （以下哪个例子代表纯合生物？）": "A. GG （A. GG）",
          "36. how is an organism classified if it has two different alleles for the same gene (e.g., gg)? （如果一个生物体对同一个基因有两个不同的等位基因（例如gg），它被归类为什么？）": "A. Heterozygous （A. 杂合子）",
          "37. what is the punnett square used to predict? （普纳特方格/庞氏表用于预测什么？）": "C. The probability of offspring inheriting specific genotypes and phenotypes （C. 后代遗传特定基因型和表型的概率）",
          "38. who developed the punnett square? （谁发明了普纳特方格/庞氏表？）": "C. Reginald C. Punnett （C. 雷金纳德·C·普纳特）",
          "39. in what year was the punnett square developed to visually represent mendelian inheritance? （普纳特方格是在哪一年被开发出来以直观地表示孟德尔遗传的？）": "A. 1905 （A. 1905）",
          "40. what happens to alleles for each gene during gamete formation? （在配子形成过程中，每个基因的等位基因会发生什么？）": "C. They segregate from each other （C. 它们彼此分离）",
          "1. what term describes pea plants that are self-pollinating and produce offspring with identical traits to themselves? （什么术语描述自花授粉并产生与自身性状相同的后代的豌豆植物？）": "C. True breeding （C. 纯种繁殖）",
          "2. how did gregor mendel prevent self-pollination in his pea plants during his experiments? （格雷戈尔·孟德尔在实验中如何防止豌豆植物自花授粉？）": "B. He cut away the pollen-bearing male parts （B. 他切除了带有花粉的雄性部分）",
          "3. when mendel crossed true-breeding tall plants with true-breeding short plants, what was the result in the f1 generation? （当孟德尔将纯种高植株与纯种矮植株杂交时，f1代的结果是什么？）": "A. All plants were tall （A. 所有植株都是高的）",
          "4. what happens to alleles for a specific gene during the formation of gametes? （在配子形成过程中，特定基因的等位基因会发生什么？）": "D. They segregate from each other （D. 它们彼此分离）",
          "5. in mendel’s f2 generation, approximately what fraction of the plants showed the trait controlled by the recessive allele? （在孟德尔的f2代中，大约有多少比例的植株表现出由隐性等位基因控制的性状？）": "B. 1/4 （B. 1/4）",
          "6. which term refers to the physical characteristics of an organism, such as green pod color? （哪个术语指的是生物体的物理特征，例如绿色豆荚颜色？）": "C. Phenotype （C. 表型）",
          "7. an organism that has two identical alleles for a particular gene (such as gg or gg) is described as what? （对于特定基因拥有两个相同等位基因（如gg或gg）的生物体被描述为什么？）": "A. Homozygous （A. 纯合子）",
          "8. what principle states that genes for different traits can segregate independently during the formation of gametes? （哪个原则指出在配子形成过程中，不同性状的基因可以独立分离？）": "B. The principle of independent assortment （B. 自由组合原则）",
          "9. a cross between red-flowered and white-flowered four o'clock plants results in pink flowers. what pattern of inheritance is this? （红花和白花紫茉莉杂交产生粉红花。这是什么遗传模式？）": "C. Incomplete dominance （C. 不完全显性）",
          "10. what factor explains why buckeye butterflies hatching in autumn have darker wing patterns than those hatching in summer? （什么因素解释了为什么秋天孵化的七叶树蝴蝶比夏天孵化的翅膀图案更深？）": "C. Environmental influence on gene expression （C. 环境对基因表达的影响）",
          "11. what is the primary reason given for the difference in health outcomes between the pima indians in mexico and the pima indians in arizona? （导致墨西哥皮马印第安人和亚利桑那皮马印第安人健康结果差异的主要原因是什么？）": "B. The Pima in Arizona experienced a change in environment and diet, while the Pima in Mexico maintained a traditional lifestyle. （B. 亚利桑那的皮马人经历了环境和饮食的变化，而墨西哥的皮马人保持了传统的生活方式。）",
          "12. what is the function of the \"thrifty gene\" described in the textbook? （教科书中描述的“节俭基因”的功能是什么？）": "A. It is excellent at storing fat to help survive famines. （A. 它非常善于储存脂肪以帮助在饥荒中生存。）",
          "13. the study of the dutch hunger winter demonstrated that environmental factors can impact health at which stage of life? （荷兰饥饿冬天的研究表明，环境因素可以在生命的哪个阶段影响健康？）": "A. Before birth (prenatally) （A. 出生前（产前））",
          "14. what happened to the metabolisms of the babies who were in the womb during the dutch hunger winter? （在荷兰饥饿冬天期间在子宫里的婴儿的新陈代谢发生了什么？）": "A. They were programmed to be \"thrifty\" and hoard every calorie. （A. 它们被编程为“节俭”并囤积每一卡路里。）",
          "15. in the nasa twin study, what occurred to scott kelly's telomeres while he was in space? （在nasa双胞胎研究中，斯科特·凯利在太空时端粒发生了什么？）": "B. They got longer, which is a sign of cellular survival mode. （B. 它们变长了，这是细胞生存模式的标志。）",
          "16. what percentage of scott kelly's genes remained altered months after he returned to earth? （斯科特·凯利回到地球几个月后，有多少百分比的基因仍然发生了改变？）": "C. 0.07 （C. 0.07）",
          "17. in the textbook \"genetics loads the gun, but the environment pulls the trigger,\" what represents the \"gun\"? （在教科书“基因给枪上膛，但环境扣动扳机”中，什么代表“枪”？）": "A. Genetic predisposition or potential risk （A. 遗传易感性或潜在风险）",
          "18. how does the textbook describe the relationship between dna and epigenetics? （教科书如何描述dna与表观遗传学之间的关系？）": "C. DNA is the hardware; epigenetics is the software. （C. DNA是硬件；表观遗传学是软件。）",
          "19. according to the textbook, how do whole foods like leafy greens assist in gene regulation? （根据教科书，像绿叶蔬菜这样的全食如何辅助基因调节？）": "C. They provide methyl groups that help \"switch off\" bad genes. （C. 它们提供甲基基团，帮助“关闭”坏基因。）",
          "20. what is the \"mismatch\" referred to in the stories of the pima indians and the dutch hunger winter babies? （在皮马印第安人和荷兰饥饿冬天婴儿的故事中提到的“错配”指的是什么？）": "B. The conflict between a biological programming for scarcity and an environment of abundance. （B. 针对稀缺的生物编程与富足环境之间的冲突。）",
          "21. in a case of incomplete dominance, what describes the phenotype of a heterozygous individual? （在不完全显性的情况下，如何描述杂合个体的表型？）": "D. It lies somewhere between the two homozygous phenotypes. （D. 它介于两种纯合表型之间。）",
          "22. when a red-flowered (rr) four o'clock plant is crossed with a white-flowered (rr) four o'clock plant, what is the color of the offspring? （当红花（rr）紫茉莉与白花（rr）紫茉莉杂交时，后代的颜色是什么？）": "D. Pink （D. 粉红色）",
          "23. which term describes a situation where the phenotypes produced by both alleles are clearly expressed, such as in \"erminette\" chickens? （哪个术语描述了两个等位基因产生的表型都清晰表达的情况，例如在“厄米特”鸡中？）": "A. Codominance （A. 共显性）",
          "24. a rabbit's coat color is determined by a single gene that has at least four different alleles. this is an example of which pattern of inheritance? （兔子的毛色由具有至少四个不同等位基因的单个基因决定。这是哪种遗传模式的例子？）": "D. Multiple alleles （D. 复等位基因）",
          "25. based on the provided textbook regarding blood type genetics, which genotype represents a person with blood type o? （根据提供的关于血型遗传学的教科书，哪种基因型代表o型血的人？）": "C. IOIO （C. IOIO）",
          "26. according to the textbook, which blood type is considered the universal recipient because they can receive blood from any other type (o-, o+, b-, b+, a-, a+, ab-, ab+)? （根据教科书，哪种血型被认为是万能受血者，因为他们可以接收任何其他类型的血液（o-, o+, b-, b+, a-, a+, ab-, ab+）？）": "B. AB+ （B. AB+）",
          "27. examining the \"antibodies in plasma\" textbook, which antibodies are found in the plasma of a person with type a blood? （查阅“血浆中的抗体”教科书，a型血的人的血浆中发现了哪些抗体？）": "B. Anti-B （B. 抗B）",
          "28. in the example of human cholesterol levels mentioned in the textbook, how does the heterozygous form of the gene function? （在教科书中提到的人类胆固醇水平的例子中，基因的杂合形式如何发挥作用？）": "A. It produces a blended protein that functions at half capacity. （A. 它产生一种混合蛋白，以一半的能力发挥作用。）",
          "29. which antigens are present on the red blood cells of an individual with blood type ab? （ab型血个体的红细胞上存在哪些抗原？）": "D. Both A and B antigens （D. A和B抗原都有）",
          "30. according to the donor compatibility textbook, a person with blood type o- can donate to which of the following recipients? （根据献血兼容性教科书，o-型血的人可以捐献给以下哪些受血者？）": "D. All recipient blood types (O, A, B, AB positive and negative) （D. 所有受血者血型（O, A, B, AB阳性和阴性））",
          "31. what characteristic will an organism exhibit if it possesses both a dominant allele and a recessive allele for a particular trait? （如果一个生物体对特定性状同时拥有显性等位基因和隐性等位基因，它将表现出什么特征？）": "C. The dominant characteristic （C. 显性特征）",
          "32. which term describes the set of observable characteristics or traits of an organism? （哪个术语描述了生物体的一组可观察的特征或性状？）": "B. Phenotype （B. 表型）",
          "33. what is the definition of genotype? （基因型的定义是什么？）": "D. The genetic makeup of an organism （D. 生物体的遗传构成）",
          "34. which of the following examples represents a homozygous genotype? （以下哪个例子代表纯合基因型？）": "D. GG （D. GG）",
          "35. what term is used to describe organisms that have two different alleles for the same gene? （用什么术语来描述对同一个基因有两个不同等位基因的生物体？）": "B. Heterozygous （B. 杂合子）",
          "36. what is the primary purpose of a punnett square? （普纳特方格/庞氏表的主要目的是什么？）": "B. To predict the probability of offspring inheriting specific genotypes and phenotypes （B. 预测后代遗传特定基因型和表型的概率）",
          "37. who developed the punnett square? （谁发明了普纳特方格/庞氏表？）": "D. Reginald C. Punnett （D. 雷金纳德·C·普纳特）",
          "38. in what year was the punnett square developed? （普纳特方格是在哪一年发明的？）": "C. 1905 （C. 1905）",
          "39. what happens to the alleles for each gene during gamete formation? （在配子形成过程中，每个基因的等位基因会发生什么？）": "B. They segregate from each other （B. 它们彼此分离）",
          "40. how many alleles for each gene does a single gamete carry? （单个配子携带每个基因的多少个等位基因？）": "D. One （D. 一个）",
          "what is the definition of heredity?": "The passing on of traits from parents to their offspring",
          "why did gregor mendel choose to conduct his experiments on ordinary garden peas?": "They are small, easy to grow, and produce hundreds of offspring",
          "what describes the relationship between genes and alleles?": "Alleles are the different forms of a single gene",
          "what occurs during the process of fertilization in pea plants?": "Male and female reproductive cells join to produce a new cell",
          "according to mendel’s principle of dominance, what happens if an organism has both a dominant allele and a recessive allele for a specific trait?": "The organism will exhibit the dominant characteristic",
          "what does the principle of dominance state?": "Some alleles are dominant and others are recessive",
          "what term describes the set of observable characteristics or traits of an organism?": "Phenotype",
          "which term refers to the genetic makeup of an organism?": "Genotype",
          "an organism with two identical alleles for a particular gene is described as:": "Homozygous",
          "if an organism has both a dominant allele and a recessive allele for a particular trait, what will it exhibit?": "The dominant characteristic",
          "what characterizes single-gene traits?": "They are determined by a single gene and follow Mendelian inheritance patterns",
          "which of the following is considered a dominant trait for earlobe attachment?": "Free Earlobes",
          "what is the expected phenotype percentage for offspring in a homozygous cross for freckles (ff × ff)?": "100% have freckles",
          "in the example of a heterozygous cross for tongue rolling (rr × rr), what percentage of offspring are expected to be \"non-rollers\"?": "0.25",
          "if a parent with dimples (dd) and a parent without dimples (dd) have children, what percentage of the offspring are expected to have dimples?": "0.5",
          "in a case of incomplete dominance, what describes the phenotype of a heterozygous individual?": "It lies somewhere between the two homozygous phenotypes.",
          "which term describes a situation where the phenotypes produced by both alleles are clearly expressed, such as chickens in the photo?": "Codominance",
          "a rabbit's coat color is determined by a single gene that has at least four different alleles. this is an example of which pattern of inheritance?": "Multiple alleles",
          "which blood type is considered the universal recipient because they can receive blood from any other type (o-, o+, b-, b+, a-, a+, ab-, ab+)?": "AB+",
          "a person with blood type o- can donate to which of the following recipients?": "All recipient blood types (O, A, B, AB positive and negative)",
          "a woman with type o blood and a man with type ab blood have a child. what are the possible blood types for this offspring?": "Type A or Type B",
          "what characterizes a polygenic trait?": "It is controlled by two or more genes interacting.",
          "if a person has the genotype \"bb\", which blood types can they donate blood to?": "Type B and Type AB",
          "mrs. clink has type a blood and mr. clink has type o blood. why is it genetically impossible for them to be the biological parents of a child with type ab blood?": "Neither parent possesses the B allele required to produce a Type AB child.",
          "a mother has type a blood and her baby has type b blood. which of the following men could not be the father?": "A man with Type O blood",
          "the study of the dutch hunger winter demonstrated that environmental factors can impact health at which stage of life?": "Before birth (prenatally)",
          "in the nasa twin study, what occurred to scott kelly's telomeres while he was in space?": "They got longer, which is a sign of cellular survival mode.",
          "in the analogy \"genetics loads the gun, but the environment pulls the trigger,\" what represents the \"gun\"?": "Genetic predisposition or potential risk",
          "how does the lesson describe the relationship between dna and epigenetics?": "DNA is the hardware; epigenetics is the software.",
          "how do whole foods like leafy greens assist in gene regulation?": "They provide methyl groups that help \"switch off\" bad genes.",
          "when mendel crossed true-breeding tall plants with true-breeding short plants, what was the result in the f1 generation?": "All plants were tall",
          "what happens to alleles for a specific gene during the formation of gametes?": "They segregate from each other",
          "in mendel’s f2 generation, approximately what fraction of the plants showed the trait controlled by the recessive allele?": "1/4",
          "an organism that has two identical alleles for a particular gene (such as gg or gg) is described as what?": "Homozygous",
          "a cross between red-flowered and white-flowered plants results in pink flowers. what pattern of inheritance is this?": "Incomplete dominance",
          "where are genes located within the cell?": "On the chromosomes",
          "what term describes a cell that contains two sets of homologous chromosomes?": "Diploid",
          "what is the definition of \"homologous\" chromosomes?": "Chromosomes where one set comes from the male parent and the corresponding set comes from the female parent",
          "what occurs during the process called \"crossing-over\"?": "Bits and pieces of homologous chromosomes are exchanged",
          "by the end of meiosis, what is produced from a single diploid cell?": "Four haploid cells",
          "what is the primary definition of inheritable diseases according to the textbook?": "Conditions caused by abnormalities in a genome passed to offspring.",
          "which category of inheritable diseases is caused by a mutation in one specific gene?": "Single-Gene Disorders",
          "which of the following is an example of a chromosomal disorder mentioned in the textbook?": "Down Syndrome",
          "which phrase best describes the relationship between genes and environmental factors in the textbook?": "Genes load the gun, but the environment pulls the trigger.",
          "what is the main cause of multifactorial (complex) disorders?": "A combination of small variations in many genes plus environmental factors.",
          "which category of disorders is considered most important for general student awareness because lifestyle plays a huge role?": "Multifactorial Disorders",
          "what is the role of epigenetics as described in the textbook?": "It acts as chemical modifications that turn genes \"on\" or \"off\" without changing DNA.",
          "in the context of the \"triggers\" model, what triggers brain damage in a child with pku?": "Consumption of phenylalanine.",
          "how does the \"threshold effect\" explain the onset of a disease like type 2 diabetes?": "The disease only appears if environmental stress pushes a person over a certain risk level.",
          "why is early detection important for a student with a family history of colon cancer?": "It allows them to start screenings earlier in life.",
          "which of the following is listed as a primary trigger for skin cancer (melanoma)?": "UV Radiation (Sun exposure).",
          "for a student with a genetic susceptibility to lung cancer, what action multiplies their risk?": "Smoking.",
          "what is the specific genetic mechanism behind type 2 diabetes mentioned in the textbook?": "The body becomes resistant to insulin.",
          "which condition is listed under \"category a: lifestyle-responsive conditions\"?": "Hypertension",
          "what environmental factor is a major trigger for asthma?": "Air pollution and pollen.",
          "what is the genetic factor associated with myopia (nearsightedness)?": "Genes determine the shape of the eyeball.",
          "which food item acts as a trigger for g6pd deficiency?": "Fava beans.",
          "what management strategy is suggested for someone with hemophilia?": "Avoiding contact sports.",
          "which disorder is described as an x-linked recessive gene affecting retinal cones?": "Red-Green Color Blindness",
          "what is the environmental trigger for lactose intolerance?": "Consuming dairy products like milk.",
          "according to the textbook, what is the nature of single-gene disorders?": "They are strongly determined by genetics with less environmental influence on onset.",
          "what is the recommended student action for preventing heart disease in the summary table?": "Regular cardio and check cholesterol early.",
          "which of the following is not an example of a multifactorial disorder?": "Down Syndrome",
          "what does the textbook say about the \"environmental\" control for classic genetic disorders (category b)?": "It focuses on management and early detection rather than prevention.",
          "which environmental factor triggers migraines?": "Dehydration and specific foods like chocolate.",
          "what is the genetic risk factor for high cholesterol (familial hypercholesterolemia)?": "Liver struggles to remove bad cholesterol.",
          "which condition requires monitoring iron intake to avoid excess supplements?": "Thalassemia",
          "for a student with a family history of hypertension, what specific dietary advice is given?": "Watch salt intake.",
          "the textbook describes the interaction for skin cancer as:": "A trigger model where fair skin genes are the risk and UV is the trigger.",
          "which of the following is a primary trigger for high blood pressure?": "High salt intake and stress.",
          "why is destigmatization listed as a benefit of understanding inheritable diseases?": "It helps students realize genes are biology, not a \"curse\".",
          "which condition is caused by an enzyme deficiency affecting red blood cells?": "G6PD Deficiency",
          "what is the main trigger for myopia mentioned in the reference list?": "Excessive \"near work\" (screens/books).",
          "what is the recommended management for red-green color blindness?": "Using color-identifying apps.",
          "which of the following is listed as a single-gene trait in the observation table?": "Widow’s peak",
          "how are single-gene traits determined?": "By a single gene with dominant and recessive alleles",
          "which genotype represents an organism that is homozygous?": "GG",
          "what is the definition of \"phenotype\"?": "The set of observable characteristics of an organism",
          "which allele could represent the recessive trait for earlobe attachment?": "e",
          "what is the dominant phenotype for the \"hitchhiker’s thumb\" trait": "Straight Thumb",
          "what is a punnett square used for?": "To predict the probability of offspring inheriting specific genotypes and phenotypes",
          "if a parent with genotype dd (dimples) crosses with a parent with genotype dd (no dimples), what is the probability of the offspring having dimples?": "0.5",
          "what is the result of a homozygous cross between ff (freckles) and ff (no freckles)?": "100% of offspring have freckles (Ff)",
          "in a heterozygous cross (rr x rr) for tongue rolling, what percentage of offspring are expected to be non-rollers (rr)?": "0.25",
          "who is known as the father of modern genetics?": "Gregor Mendel",
          "why did mendel use pea plants for his experiments?": "They are small, easy to grow, and produce hundreds of offspring",
          "what does the term \"true-breeding\" mean in the context of mendel's plants?": "They produce offspring with identical traits to themselves through self-pollination",
          "what are \"hybrids\" in mendel's experiments?": "Offspring of crosses between parents with different contrasting characteristics",
          "in mendel's f1 generation crosses, what did he observe about the traits?": "The offspring had the characteristics of only one of the parents",
          "approximately what fraction of the f2 generation plants showed the recessive trait in mendel's experiments?": "One fourth (1/4)",
          "what does the principle of dominance state?": "An organism with both a dominant and recessive allele will exhibit the dominant characteristic",
          "what happens to alleles during gamete formation?": "They segregate (separate) from each other",
          "which year was gregor mendel born?": "1822",
          "what technique did mendel use to cross-pollinate plants?": "He cut away the pollen-bearing male parts and dusted pollen from another plant",
          "what does the \"f\" in f1 generation stand for?": "Filial",
          "which pod color was dominant in mendel's experiments?": "Green",
          "which seed shape was recessive in mendel's experiments?": "Wrinkled",
          "what is the recessive phenotype for the \"cleft chin\" trait?": "No Cleft Chin",
          "what is the definition of \"heredity\"?": "The passing of physical or mental characteristics from parents to offspring",
          "which term describes organisms that have two different alleles for the same gene (e.g., gg)?": "Heterozygous",
          "what did mendel assume happened to the recessive alleles in the f1 generation before seeing the f2 results?": "He assumed they had been masked by the dominant allele",
          "what term refers to the reproductive cells (sperm and egg)?": "Gametes",
          "which country is mentioned as the birthplace of gregor mendel?": "Austria (now Czech Republic)"
}
